In [119]:
import numpy as np
import pandas as pd
! pip install seaborn
import seaborn as sns
import matplotlib.pyplot as plt

Requirement already satisfied: seaborn in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (0.11.2)
Requirement already satisfied: scipy>=1.0 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (1.7.2)
Requirement already satisfied: matplotlib>=2.2 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (3.4.3)
Requirement already satisfied: pandas>=0.23 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (1.4.3)
Requirement already satisfied: numpy>=1.15 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from seaborn) (1.21.4)
Requirement already satisfied: cycler>=0.10 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\pc\appdata\roaming\python\python310\site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (8.4.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from matplotlib>=2.2->seaborn) (3.0.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\pc\appdata\local\programs\python\python310\lib\site-packages (from pandas>=0.23->seaborn) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\pc\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)

WARNING: You are using pip version 22.0.4; however, version 22.2.1 is available.
You should consider upgrading via the 'C:\Users\pc\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [120]:
data = sns.load_dataset('titanic')

In [121]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## Print columns of ``data``

In [122]:
data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

## Get number of nan values per column

In [123]:
data.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## Display the following :
- show the 5 first lines
- print a summary statistics of your columns (numerical and categorical apart)

In [124]:
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [125]:
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [126]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

## Replace nan values in age with mean

In [127]:
# Replace null value in age column

data['age'].fillna(value=data['age'].mean(), inplace=True)
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## Do the following : 
- first  (such as ``Embarked column`` )  and  convert them into ``category`` type
- then Replace null values in embarked and fare columns with mode. or median.detect which columns are categorical

In [128]:

list_str_obj_cols = data.columns[data.dtypes == "object"].tolist()
for str_obj_col in list_str_obj_cols:
    data[str_obj_col] = data[str_obj_col].astype("category")
data.dtypes

survived          int64
pclass            int64
sex            category
age             float64
sibsp             int64
parch             int64
fare            float64
embarked       category
class          category
who            category
adult_male         bool
deck           category
embark_town    category
alive          category
alone              bool
dtype: object

## Print the frequency of embarked , then normalize them

In [129]:
#print the frequency of embarked

count=data['embarked'].value_counts(normalize=True)

## Drop the column fare

In [130]:

data.drop(axis=1, columns='fare', inplace=False)#inplace should be true but in order to answer the next questions we make it false
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## Average age of the woman passengers:

In [131]:
data.groupby('sex')['age'].mean().loc['female']

28.21673004870738

## Average age of the male passengers.

In [132]:
data.groupby('sex')['age'].mean().loc['male']

30.505824243042102

## The max age among the male passengers:

In [133]:
data.groupby('sex')['age'].max().loc['male']

80.0

## Create a new column age2 = age +12

In [134]:
data['age2']=data['age']+12
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age2
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,34.000000
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,50.000000
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,38.000000
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,47.000000
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,47.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,39.000000
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,31.000000
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,41.699118
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,38.000000
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,44.000000

## Calculate The min age among the female passengers:

In [135]:
data.groupby('sex')['age'].min().loc['female']

0.75

## Calculate the min age among the alive male passengers.

In [136]:
data.groupby(['sex','alive'])['age'].min().loc['male'].loc['yes']

0.42

##  Average the age of  **male** passengers in First or Second class:

In [137]:
data.groupby(['sex','class'])['age'].mean().loc['male'].loc['First' or 'Second']

39.287716972034715

## Get total age of embarked equals to S or C.

In [138]:
data.groupby('embarked')['age'].sum().loc['S'or 'C']

18985.670588235294

##  Sort the DataFrame in ascending order of the 'age' use ``sort_values (df.sort_values(by='...', ascending=...)).``

In [139]:
data.sort_values(by='age',ascending=True)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age2
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False,12.42
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False,12.67
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False,12.75
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False,12.75
831,1,2,male,0.83,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False,12.83
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
116,0,3,male,70.50,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,82.50
96,0,1,male,71.00,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True,83.00
493,0,1,male,71.00,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True,83.00
851,0,3,male,74.00,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True,86.00
630,1,1,male,80.00,0,0,30.0000,S,First,man,True,A,Southampton,yes,True,92.00

**Aggregating**


Documentation : https://pbpython.com/groupby-agg.html

Aggregation function is one which takes multiple individual values and returns a summary.

The most common aggregation functions are a simple average or summation of values.

Here’s a quick example of calculating the total and average fare using the Titanic dataset (loaded from seaborn):

In [140]:
 data.groupby(by="embark_town").mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone,age2
embark_town,,,,,,,,,
Cherbourg,0.553571,1.886905,30.562419,0.386905,0.363095,59.954144,0.535714,0.505952,42.562419
Queenstown,0.389610,2.909091,29.113724,0.428571,0.168831,13.276030,0.480519,0.740260,41.113724
Southampton,0.336957,2.350932,29.480855,0.571429,0.413043,27.079812,0.636646,0.610248,41.480855

In [141]:
 data.groupby(by="embark_town").describe()

            survived                                              pclass  \
               count      mean       std  min  25%  50%  75%  max  count
embark_town
Cherbourg      168.0  0.553571  0.498608  0.0  0.0  1.0  1.0  1.0  168.0
Queenstown      77.0  0.389610  0.490860  0.0  0.0  0.0  1.0  1.0   77.0
Southampton    644.0  0.336957  0.473037  0.0  0.0  0.0  1.0  1.0  644.0

                       ...       fare             age2                        \
                 mean  ...        75%       max  count       mean        std
embark_town            ...
Cherbourg    1.886905  ...  78.500025  512.3292  168.0  42.562419  13.573685
Queenstown   2.909091  ...  15.500000   90.0000   77.0  41.113724  10.112332
Southampton  2.350932  ...  27.900000  263.0000  644.0  41.480855  13.116389


               min        25%        50%        75%   max
embark_town
Cherbourg    12.42  35.375000  41.699118  48.000000  83.0
Queenstown   14.00  41.699118  41.699118  41.699118  82.5
Southampton  12.67  34.000000  41.699118  48.000000  92.0

[3 rows x 56 columns]

In [143]:
data.groupby(by="embark_town").agg(age_mean=("age","mean"),fare_median=("fare","median"))

              age_mean  fare_median
embark_town
Cherbourg    30.562419        29.70
Queenstown   29.113724         7.75
Southampton  29.480855        13.00

## Average age for each embark_town. Use the groupby() method.

In [144]:
data.groupby('embark_town').age.mean()

embark_town
Cherbourg      30.562419
Queenstown     29.113724
Southampton    29.480855
Name: age, dtype: float64

## Average age of each embark_town with respect to class. Use the pivot_table() method.

- repeate the same but using fare as values. 
- use at least two aggregation functions (sum , mean ,...etc)   

Pivot Table

Documentation : 

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html

In [146]:
pd.pivot_table(data, index=['embark_town','class'], values=['age'], aggfunc=np.mean)

                          age
embark_town class
Cherbourg   First   36.949298
            Second  23.582249
            Third   24.134817
Queenstown  First   38.500000
            Second  38.899706
            Third   28.445245
Southampton First   36.887427
            Second  30.353189
            Third   26.410891

## Average age and fare for each embark_town using groupby()

In [147]:
pd.pivot_table(data, index=['embark_town'], values=['age','fare'], aggfunc=np.mean)

                   age       fare
embark_town
Cherbourg    30.562419  59.954144
Queenstown   29.113724  13.276030
Southampton  29.480855  27.079812

## Sort the DataFrame in ascending order of the 'embark_town'. Show the top 20.

In [148]:
data.sort_values(by='embark_town',ascending=True).head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age2
258,1,1,female,35.000000,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True,47.000000
125,1,3,male,12.000000,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False,24.000000
354,0,3,male,29.699118,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,41.699118
352,0,3,male,15.000000,1,1,7.2292,C,Third,child,False,NaN,Cherbourg,no,False,27.000000
128,1,3,female,29.699118,1,1,22.3583,C,Third,woman,False,F,Cherbourg,yes,False,41.699118
641,1,1,female,24.000000,0,0,69.3000,C,First,woman,False,B,Cherbourg,yes,True,36.000000
130,0,3,male,33.000000,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True,45.000000
798,0,3,male,30.000000,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,42.000000
644,1,3,female,0.750000,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False,12.750000
645,1,1,male,48.000000,1,0,76.7292,C,First,man,True,D,Cherbourg,yes,False,60.000000
647,1,1,male,56.000000,0,0,35.5000,C,First,man,True,A,Cherbourg,yes,True,68.000000
135,0,2,male,23.000000,0,0,15.0458,C,Second,man,True,NaN,Cherbourg,no,True,35.000000
337,1,1,female,41.000000,0,0,134.5000,C,First,woman,False,E,Cherbourg,yes,True,53.000000
793,0,1,male,29.699118,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,41.699118
139,0,1,male,24.000000,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True,36.000000
140,0,3,female,29.699118,0,2,15.2458,C,Third,woman,False,NaN,Cherbourg,no,False,41.699118
329,1,1,female,16.000000,0,1,57.9792,C,First,woman,False,B,Cherbourg,yes,False,28.000000
789,0,1,male,46.000000,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True,58.000000
325,1,1,female,36.000000,0,0,135.6333,C,First,woman,False,C,Cherbourg,yes,True,48.000000
659,0,1,male,58.000000,0,2,113.2750,C,First,man,True,D,Cherbourg,no,False,70.000000